Autodesk.Revit.UI.Selection.ISelectionFilter.AllowReference(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ)
Override this post-filter method to specify if a reference to a piece of geometry is permitted to be selected.
Returns: Return true to allow the user to select this candidate reference. Return false to prevent selection of this candidate.
reference: A candidate reference in selection operation.
position: The 3D position of the mouse on the candidate reference.
Remarks: If an exception is thrown from this method, the element will not be permitted to be selected.

Autodesk.Revit.UI.Selection.ISelectionFilter.AllowElement(Autodesk.Revit.DB.Element)
Override this pre-filter method to specify if the element should be permitted to be selected.
Returns: Return true to allow the user to select this candidate element. Return false to prevent selection of this element.
elem: A candidate element in selection operation.
Remarks:
If prompting the user to select an element from a Revit Link instance, the element passed here will be the link instance, not the selected linked element.
Access the linked element from Reference passed to the AllowReference() callback of ISelectionFilter.
If an exception is thrown from this method, the element will not be permitted to be selected.

Autodesk.Revit.UI.Selection.ISelectionFilter
An interface that provides the ability to filter objects during a selection operation.